app/views/bookings/index.html.erb

        <td><%= booking.lawn %></td>
        <td><%= User.find(booking.user_id).email %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1