app/views/bookings/show.html.erb

  <strong>User:</strong>
  <%= User.find(@booking.user_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]