app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)

    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("created_at", "date", "status", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Dec 2013 04:25:31 UTC +00:00], ["date", Mon, 02 Dec 2013], ["status", ""], ["updated_at", Mon, 02 Dec 2013 04:25:31 UTC +00:00]]

  def update
    respond_to do |format|
      if @booking.update(booking_params)
---
UPDATE "bookings" SET "end_time" = ?, "updated_at" = ? WHERE "bookings"."id" = 3  [["end_time", 2000-01-01 14:58:00 UTC], ["updated_at", Mon, 02 Dec 2013 05:00:48 UTC +00:00]]

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]