app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all.sort_by &:date
---
SELECT "newsletters".* FROM "newsletters"

  def create
    @newsletter = Newsletter.new(newsletter_params)

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO "newsletters" ("created_at", "date", "pdf", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 00:22:01 UTC +00:00], ["date", Tue, 19 Nov 2013], ["pdf", "sasda"], ["title", "s"], ["updated_at", Tue, 19 Nov 2013 00:22:01 UTC +00:00]]

  def destroy
    @newsletter.destroy
---
DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 1]]

    def set_newsletter
      @newsletter = Newsletter.find(params[:id])
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = ? LIMIT 1  [["id", "1"]]