app/controllers/programmes_controller.rb

  def index
    @programmes = Programme.all
---
SELECT "programmes".* FROM "programmes"

  def create
    @programme = Programme.new(programme_params)

    respond_to do |format|
      if @programme.save
---
INSERT INTO "programmes" ("created_at", "date", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_programme
      @programme = Programme.find(params[:id])
---
SELECT "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT 1  [["id", "3"]]